### Terraform Plan Output for `prod-team-account/deploy/iam`
```hcl
[command]/home/runner/work/_temp/5a44474a-83e3-41e7-8e8d-a595a60f27a3/terraform-bin show -no-color tfplan.binary

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_instance_profile.ecs_instance_profile will be created
  + resource "aws_iam_instance_profile" "ecs_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "cloudfence-ecs-instance-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "cloudfence-ecs-instance-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_role.codedeploy_role will be created
  + resource "aws_iam_role" "codedeploy_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codedeploy.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cloudfence-codedeploy-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.ecs_instance_role will be created
  + resource "aws_iam_role" "ecs_instance_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cloudfence-ecs-instance-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "cloudfence-ecs-instance-role"
        }
      + tags_all              = {
          + "Name" = "cloudfence-ecs-instance-role"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.ecs_task_execution_role will be created
  + resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cloudfence-ecs-task-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.codedeploy_role_attachment will be created
  + resource "aws_iam_role_policy_attachment" "codedeploy_role_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSCodeDeployRoleForECS"
      + role       = "cloudfence-codedeploy-role"
    }

  # aws_iam_role_policy_attachment.ecs_instance_role_attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecs_instance_role_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "cloudfence-ecs-instance-role"
    }

  # aws_iam_role_policy_attachment.ecs_task_execution_role_attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "cloudfence-ecs-task-execution-role"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + codedeploy_service_role_arn = (known after apply)
  + ecs_instance_profile_name   = "cloudfence-ecs-instance-profile"
  + ecs_task_execution_role_arn = (known after apply)
  + github_actions_role_arn     = "arn:aws:iam::243359234795:role/Application-Deployment-role2"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_iam_instance_profile.ecs_instance_profile will be created%0A  + resource "aws_iam_instance_profile" "ecs_instance_profile" {%0A      + arn         = (known after apply)%0A      + create_date = (known after apply)%0A      + id          = (known after apply)%0A      + name        = "cloudfence-ecs-instance-profile"%0A      + name_prefix = (known after apply)%0A      + path        = "/"%0A      + role        = "cloudfence-ecs-instance-role"%0A      + tags_all    = (known after apply)%0A      + unique_id   = (known after apply)%0A    }%0A%0A  # aws_iam_role.codedeploy_role will be created%0A  + resource "aws_iam_role" "codedeploy_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "codedeploy.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "cloudfence-codedeploy-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # aws_iam_role.ecs_instance_role will be created%0A  + resource "aws_iam_role" "ecs_instance_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ec2.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "cloudfence-ecs-instance-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags                  = {%0A          + "Name" = "cloudfence-ecs-instance-role"%0A        }%0A      + tags_all              = {%0A          + "Name" = "cloudfence-ecs-instance-role"%0A        }%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # aws_iam_role.ecs_task_execution_role will be created%0A  + resource "aws_iam_role" "ecs_task_execution_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ecs-tasks.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "cloudfence-ecs-task-execution-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # aws_iam_role_policy_attachment.codedeploy_role_attachment will be created%0A  + resource "aws_iam_role_policy_attachment" "codedeploy_role_attachment" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AWSCodeDeployRoleForECS"%0A      + role       = "cloudfence-codedeploy-role"%0A    }%0A%0A  # aws_iam_role_policy_attachment.ecs_instance_role_attachment will be created%0A  + resource "aws_iam_role_policy_attachment" "ecs_instance_role_attachment" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"%0A      + role       = "cloudfence-ecs-instance-role"%0A    }%0A%0A  # aws_iam_role_policy_attachment.ecs_task_execution_role_attachment will be created%0A  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_attachment" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"%0A      + role       = "cloudfence-ecs-task-execution-role"%0A    }%0A%0APlan: 7 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + codedeploy_service_role_arn = (known after apply)%0A  + ecs_instance_profile_name   = "cloudfence-ecs-instance-profile"%0A  + ecs_task_execution_role_arn = (known after apply)%0A  + github_actions_role_arn     = "arn:aws:iam::243359234795:role/Application-Deployment-role2"%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_iam_instance_profile.ecs_instance_profile will be created%0A  + resource "aws_iam_instance_profile" "ecs_instance_profile" {%0A      + arn         = (known after apply)%0A      + create_date = (known after apply)%0A      + id          = (known after apply)%0A      + name        = "cloudfence-ecs-instance-profile"%0A      + name_prefix = (known after apply)%0A      + path        = "/"%0A      + role        = "cloudfence-ecs-instance-role"%0A      + tags_all    = (known after apply)%0A      + unique_id   = (known after apply)%0A    }%0A%0A  # aws_iam_role.codedeploy_role will be created%0A  + resource "aws_iam_role" "codedeploy_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "codedeploy.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "cloudfence-codedeploy-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # aws_iam_role.ecs_instance_role will be created%0A  + resource "aws_iam_role" "ecs_instance_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ec2.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "cloudfence-ecs-instance-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags                  = {%0A          + "Name" = "cloudfence-ecs-instance-role"%0A        }%0A      + tags_all              = {%0A          + "Name" = "cloudfence-ecs-instance-role"%0A        }%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # aws_iam_role.ecs_task_execution_role will be created%0A  + resource "aws_iam_role" "ecs_task_execution_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ecs-tasks.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "cloudfence-ecs-task-execution-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # aws_iam_role_policy_attachment.codedeploy_role_attachment will be created%0A  + resource "aws_iam_role_policy_attachment" "codedeploy_role_attachment" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AWSCodeDeployRoleForECS"%0A      + role       = "cloudfence-codedeploy-role"%0A    }%0A%0A  # aws_iam_role_policy_attachment.ecs_instance_role_attachment will be created%0A  + resource "aws_iam_role_policy_attachment" "ecs_instance_role_attachment" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"%0A      + role       = "cloudfence-ecs-instance-role"%0A    }%0A%0A  # aws_iam_role_policy_attachment.ecs_task_execution_role_attachment will be created%0A  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_attachment" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"%0A      + role       = "cloudfence-ecs-task-execution-role"%0A    }%0A%0APlan: 7 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + codedeploy_service_role_arn = (known after apply)%0A  + ecs_instance_profile_name   = "cloudfence-ecs-instance-profile"%0A  + ecs_task_execution_role_arn = (known after apply)%0A  + github_actions_role_arn     = "arn:aws:iam::243359234795:role/Application-Deployment-role2"%0A

::set-output name=stderr::

::set-output name=exitcode::0
```